public class Text {
    public static void introduction() {
        System.out.println("****************************************  Ιαπωνία  ******************************************" +
                "\n   Μετά τη μάχη στη Σεκιγκαχάρα το 1600, η ανώτατη δύναμη στην Ιαπωνία πέρασε στον Τοκουγκάουα" +
                "\nΙεγιάσου, ο οποίος ολοκλήρωσε τη διαδικασία ενοποίησης της Ιαπωνίας και έλαβε τον τίτλο του" +
                "\nσογκούν το 1603. Έγινε ο ιδρυτής της δυναστείας των σογκούν, η οποία διήρκεσε μέχρι τα μέσα" +
                "\nτου 19ου αιώνα." +
                "\n   Ωστόσο, στις αρχές του 18ου αιώνα, διάφοροι σαμουράι περιφέρονταν στη χώρα, έχοντας χάσει τους" +
                "\nπροστάτες τους ως αποτέλεσμα εσωτερικών πολέμων. Επιθετόντουσαν σε σπίτια εύπορων πολιτών," +
                "\nλήστευαν και σκότωναν ανθρώπους. Αυτό ήταν ένα μεγάλο πρόβλημα για την εξουσία που δεν ήταν ακόμα" +
                "\nισχυρή, και ως εκ τούτου οι καλύτεροι πολεμιστές του σογκουνάτου στελνόντουσαν για να" +
                "\nεξουδετερώνουν τέτοιους σαμουράι." +
                "\n   Εδώ είναι μια από αυτές τις μάχες.");
    }

    public static void akechiMitsuhide() {
        System.out.println("\n   Στο κέντρο της μάχης που μαίνεται με μανία, εμφανίζεται περήφανα ο Akechi Mitsuhide. Είναι" +
                "\nδιάσημος πολεμιστής στρατού, πεζός με την αστραφτερή πανοπλία του, ακμαίος, σε κάθε χέρι κρατάει" +
                "\nαπό ένα katana και μέχρι τώρα δεν έχει ούτε μια γρατζουνιά.");
    }

    public static void dateMasamune() {
        System.out.println("\nΔεν ισχύει το ίδιο για τον συμπολεμιστή του, Date Masamune, που βρίσκεται λίγα βήματα πιο πίσω." +
                "\nΈχει τραυματιστεί σοβαρά και με ότι ζωή του έχει απομείνει ακολουθεί τον Akechi πάνω στο άλογο" +
                "\nτου. Η πανοπλία του είναι πλέον άχρηστη και το μόνο που του έχει απομείνει είναι το τόξο του.\n");
    }

    public static void hattoriHanzo() {
        System.out.println("\nΤελευταίος ακολουθεί ο Hattori Hanzō. Ο σκληροτράχηλος συμπολεμιστής της μικρής ομάδας, ακμαίος," +
                "\nπολύ ικανός με το μακρύ του δόρυ, έχει σκοτώσει αμέτρητους εχθρούς χωρίς να έχει τραυματιστεί" +
                "\nκαθόλου. Τρομαχτικός στην πανοπλία του, αν και έχασε στην μάχη το άλογο του, δεν θα διστάσει να" +
                "\nθυσιάσει και τον εαυτό του ακόμη, αρκεί να πετύχει αυτό που θέλουν και οι άλλοι δύο σύντροφοι του." +
                "\nΝα γίνει μια τελευταία αναμέτρηση τιμής, ζωής ή θανάτου, με τα ξακουστά περιπλανώμενα αδέρφια, που" +
                "\nλένε ότι όσοι τους συνάντησαν σε μάχη, δεν έζησαν για να το διηγηθούν.");
    }

    public static void odaNobunaga() {
        System.out.println("\nΠρώτος απέναντι τους εμφανίστηκε ο Oda Nobunaga. Ο μικρότερος αδερφός, έφιππος, ακμαίος, στο πίσω" +
                "\nμέρος της πανοπλίας του πρόβαλαν οι λαβές από δύο wakizashi που ήξερε να χειρίζεται όπως κανείς" +
                "\nάλλος και με αυτά είχε μόλις αφήσει πίσω του μια σειρά από πτώματα στρατιωτών. Κανείς δεν είχε" +
                "\nπρολάβει σήμερα να ακουμπήσει όπλο πάνω του.");
    }

    public static void takedaNobunaga() {
        System.out.println("\nΑκόμη πιο ικανός όμως, ήταν ο αδερφός του, Takeda Nobunaga, που μόλις έφτασε ξεπέζεψε από το άλογο" +
                "\nτου δίπλα στον αδερφό του και τράβηξε αργά το katana του από την θήκη του. Η πανοπλία του ήταν σαν" +
                "\nκαινούργια και αν και βαριά, δεν εμπόδιζε τις κινήσεις του στην μάχη όταν σαν άνεμος άφηνε πίσω" +
                "\nτου πτώματα.");
    }

    public static void attack(int num) {
        switch(num){
            case 1:  System.out.println("\nΟ Takeda επιτίθεται στον Akechi και στον Date σχεδόν ταυτόχρονα και με όλη του την δύναμη. Κανείς" +
                    "\nτους δεν πρόλαβε να αντιδράσει."); break;
            case 2:  System.out.println("\nΟ Oda επιτίθεται στον Hattori με όλη του την δύναμη."); break;
            case 3:  System.out.println("\nΟ Hattori αντεπιτίθεται στον Oda με όλη του την δύναμη."); break;
            case 4:  System.out.println("\nΧτυπημένος ο Date ρίχνει μια αδύναμη βολή με το τόξο του στον Takeda.");
            break;
            case 5:  System.out.println("\nΟ Akechi επιτίθεται στον Takeda με όλη του την δύναμη."); break;
            case 6:  System.out.println("\nΟ Takeda για να προστατέψει τον αδερφό του, επιτίθεται στον Hattori και καταφέρνει απανωτά χτυπήματα " +
                    "με όλη του την δύναμη."); break;
            case 7:  System.out.println("\nΧτυπημένος ο Oda επιτίθεται αδύναμα στον Akechi."); break;
            case 8:  System.out.println("\nΧτυπημένος ο Date ρίχνει μια αδύναμη βολή με τον τόξο του στον Oda.");
            break;
            case 9:  System.out.println("\nΟ Takeda βλέποντας αυτό, επιτίθεται στον Date με όλη του την δύναμη."); break;
            case 10: System.out.println("\nΟ Hattori επιτίθεται αδύναμα στον Takeda."); break;
            case 11: System.out.println("\nΧτυπημένος ο Akechi επιτίθεται αδύναμα στον Oda."); break;
            case 12: System.out.println("\nΕξαντλημένος ο Takeda, μαζεύοντας όλη του τη δύναμη επιτίθεται δυνατά στον Akechi.");
            break;
            case 13: System.out.println("\nΤρώει όμώς μια αδύναμη επίθεση από τον Hattori."); break;
            case 14: System.out.println("\nΟ Oda επιτίθεται δυνατά 2 φορες στον Akechi"); break;
            case 15: System.out.println("\nΑλλά δυστυχώς έρχεται ο Hattory και βαράει δυνατά τον Oda"); break;

        }

    }

}
